app/Controllers/Board.php



        }else{ //새글 입력
            $boardModel->insert($data);
---
INSERT INTO `board` (`userid`, `subject`, `content`) VALUES ('test', '업로드 테스트2', '업로드 테스트2')