app/Controllers/Board.php

SELECT *
FROM `board`
ORDER BY `bid` DESC
---
    public function list(): string
    {
        /*
        $db = db_connect();
        $sql = "SELECT * FROM board ORDER BY bid DESC";
        $result = $db->query($sql);
        $data['list'] = $result->getResult();//조회결과를 data에 할당
        */
        $boardModel = new BoardModel();
        $data['list'] = $boardModel->orderBy('bid', 'desc')->findAll();

SELECT *
FROM `board`
WHERE `bid` = '13'
 LIMIT 1
---
    public function view($bid=null): string
    {
        $boardModel = new BoardModel();
        $fileModel = new FileModel();

        /*
        $data['view'] = $boardModel->where('bid', $bid)->first();

SELECT *
FROM `board`
WHERE `board`.`bid` = '13'
---
    public function modify($bid=null): string
    {

        $boardModel = new BoardModel();
        $post = $boardModel->find($bid);

SELECT *
FROM `board`
WHERE `board`.`bid` = '13'
---
    public function delete($bid=null)
    {
        $boardModel = new BoardModel();
        $fileModel = new FileModel();

        $post = $boardModel->find($bid);